from typing import Dict, List, Tuple

from utilities.TypeChecking.Letters import Letters
from utilities.TypeChecking.TypeChecking import Positions


rules: Dict[Letters, List[Letters]] = {
    # Type 1
    "A": ["A", "B", "L", "C", "K", "J", "Σ", "θ-", "Ψ", "Φ-"],
    "B": ["B", "A", "L", "C", "J", "K", "Δ", "Ω-", "Ψ", "Φ-"],
    "C": ["C", "K", "J", "B", "A", "Σ", "Δ", "θ-", "Ω-", "Φ-"],
    "D": ["J", "K", "C", "L", "B", "A", "Σ", "θ-", "Ψ", "Φ-"],
    "E": ["K", "J", "C", "L", "A", "B", "Δ", "Ω-", "Ψ", "Φ-"],
    "F": ["L", "B", "A", "K", "J", "Σ", "Δ", "θ-", "Ω-", "Φ-"],
    "G": ["G", "H", "F", "I", "E", "D", "θ", "Σ-", "Φ", "Ψ-"],
    "H": ["H", "G", "F", "I", "D", "E", "Ω", "Δ-", "Φ", "Ψ-"],
    "I": ["I", "E", "D", "H", "G", "θ", "Ω", "Σ-", "Δ-", "Ψ-"],
    "J": ["D", "E", "I", "F", "H", "G", "θ", "Σ-", "Φ", "Ψ-"],
    "K": ["E", "D", "I", "F", "G", "H", "Ω", "Δ-", "Φ", "Ψ-"],
    "L": ["F", "H", "G", "E", "D", "θ", "Ω", "Σ-", "Δ-", "Ψ-"],
    "M": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "N": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "O": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "P": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "Q": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "R": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "S": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "T": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "U": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "V": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    # Type 2
    "W": ["Σ", "Δ", "A", "C", "J", "L", "B", "K", "θ-", "Ψ", "Φ-"],
    "X": ["Δ", "Σ", "B", "C", "K", "L", "A", "J", "Ω-", "Ψ", "Φ-"],
    "Y": ["θ", "Ω", "D", "G", "I", "L", "E", "H", "Σ-", "Φ", "Ψ-"],
    "Z": ["Ω", "θ", "E", "H", "I", "L", "D", "G", "Δ-", "Φ", "Ψ-"],
    "Σ": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "Δ": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "θ": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    "Ω": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    # Type 3
    "W-": ["A", "J", "C", "L", "Σ", "|Σ", "!Σ", "|Δ", "!Δ", "Φ-", "Ψ"],
    "X-": ["B", "K", "C", "L", "Δ", "|Σ", "!Σ", "|Δ", "!Δ", "Φ-", "Ψ"],
    "Y-": ["D", "G", "F", "L", "θ", "|θ", "!θ", "|Ω", "!Ω", "Ψ-", "Φ"],
    "Z-": ["E", "H", "F", "R", "Ω", "|θ", "!θ", "|Ω", "!Ω", "Ψ-", "Φ"],
    "Σ-": ["P", "S", "R", "V", "Y", "|W", "!X", "|Y", "!Z", "Λ-", "Λ"],
    "Δ-": ["Q", "T", "R", "U", "Z", "|W", "!X", "|Y", "!Z", "Λ-", "Λ"],
    "θ-": ["M", "S", "O", "U", "W", "|W", "!X", "|Y", "!Z", "Λ-", "Λ"],
    "Ω-": ["N", "T", "O", "V", "X", "|W", "!X", "|Y", "!Z", "Λ-", "Λ"],
    # Type 4
    "Φ": ["A", "B", "C", "J", "K", "L", "Σ", "Δ", "W-", "X-", "Ψ", "Φ-"],
    "Ψ": ["G", "H", "I", "D", "E", "F", "θ", "Ω", "Y-", "Z-", "Φ", "Ψ-"],
    "Λ": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    # Type 5
    "Φ-": ["A", "B", "C", "J", "K", "L", "Σ", "Δ", "W-", "X-", "Ψ", "Φ-"],
    "Ψ-": ["G", "H", "I", "D", "E", "F", "θ", "Ω", "Y-", "Z-", "Φ", "Ψ-"],
    "Λ-": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
    # Type 6
    "α": ["A", "B", "C", "J", "K", "L", "Σ", "Δ", "W-", "X-", "Ψ", "Φ-"],
    "β": ["G", "H", "I", "D", "E", "F", "θ", "Ω", "Y-", "Z-", "Φ", "Ψ-"],
    "Γ": ["M", "N", "P", "Q", "W", "X", "Y", "Z", "Y-", "Z-", "W-", "X-", "Λ-"],
}


positions: Dict[Letters, Tuple[Positions]] = {
    # Type 1
    "A": ("alpha", "alpha"),
    "B": ("alpha", "alpha"),
    "C": ("alpha", "alpha"),
    "D": ("beta", "alpha"),
    "E": ("beta", "alpha"),
    "F": ("beta", "alpha"),
    "G": ("beta", "beta"),
    "H": ("beta", "beta"),
    "I": ("beta", "beta"),
    "J": ("alpha", "beta"),
    "K": ("alpha", "beta"),
    "L": ("alpha", "beta"),
    "M": ("gamma", "gamma"),
    "N": ("gamma", "gamma"),
    "O": ("gamma", "gamma"),
    "P": ("gamma", "gamma"),
    "Q": ("gamma", "gamma"),
    "R": ("gamma", "gamma"),
    "S": ("gamma", "gamma"),
    "T": ("gamma", "gamma"),
    "U": ("gamma", "gamma"),
    "V": ("gamma", "gamma"),
    # Type 2
    "W": ("gamma", "alpha"),
    "X": ("gamma", "alpha"),
    "Y": ("gamma", "beta"),
    "Z": ("gamma", "beta"),
    "Σ": ("alpha", "gamma"),
    "Δ": ("alpha", "gamma"),
    "θ": ("beta", "gamma"),
    "Ω": ("beta", "gamma"),
    # Type 3
    "W-": ("gamma", "alpha"),
    "X-": ("gamma", "alpha"),
    "Y-": ("gamma", "beta"),
    "Z-": ("gamma", "beta"),
    "Σ-": ("beta", "gamma"),
    "Δ-": ("beta", "gamma"),
    "θ-": ("alpha", "gamma"),
    "Ω-": ("alpha", "gamma"),
    # Type 4
    "Φ": ("beta", "alpha"),
    "Ψ": ("alpha", "beta"),
    "Λ": ("gamma", "gamma"),
    # Type 5
    "Φ-": ("alpha", "alpha"),
    "Ψ-": ("beta", "beta"),
    "Λ-": ("gamma", "gamma"),
    # Type 6
    "α": ("alpha", "alpha"),
    "β": ("beta", "beta"),
    "Γ": ("gamma", "gamma"),
}
